瞭解以下目的
1. 由 Dataframe 擷取，過濾，轉換資料
2. 進階多層索引
3. 重新建立資料節
4. pivoting, melting, 及 stacking Dataframe

In [2]:
import pandas as pd
df = pd.read_csv('data/sales.txt', sep=" ", index_col='month')
df

       eggs  salt  spam  Unnamed: 4
month
Jan      47  12.0    17         NaN
Feb     110  50.0    31         NaN
Mar     221  89.0    72         NaN
Apr      77  87.0    20         NaN
May     132   NaN    52         NaN
Jun     205  60.0     5         NaN

選取單格資料

In [3]:
df['salt']['Jan']

12.0

In [4]:
df.eggs['Mar']

221

In [5]:
df.loc['May', 'spam']

52

In [6]:
df.iloc[4,2]

52

選取多行資料

In [7]:
df[['salt','eggs']]

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

In [8]:
df

       eggs  salt  spam  Unnamed: 4
month
Jan      47  12.0    17         NaN
Feb     110  50.0    31         NaN
Mar     221  89.0    72         NaN
Apr      77  87.0    20         NaN
May     132   NaN    52         NaN
Jun     205  60.0     5         NaN

In [9]:
df.columns #dataframe的欄位名稱

Index(['eggs', 'salt', 'spam', 'Unnamed: 4'], dtype='object')

In [10]:
df.drop('Unnamed: 4', axis=1, inplace=True) #利用 drop 指令將某一欄清除，指定欄位名稱，移除後更新 dataframe

In [11]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0     5

讀取某一欄資料

In [12]:
df['salt']

month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0
Name: salt, dtype: float64

In [13]:
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [14]:
df.loc[:, 'eggs':'salt'] #讀取 eggs 到 salt 欄位的所有筆資料

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [15]:
df.loc['Jan':'Apr', :] #讀取從 Jan 至 Apr 列的所有欄位資料

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [16]:
df.loc['Mar':'May', 'salt':'spam'] #讀取 Mar 至 May列及 salt 到 spam 欄的資料

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [17]:
df.iloc[2:5, 1:] #讀取 2至5列及1至最後欄資料

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [18]:
df.loc['Jan':'May', ['eggs', 'spam']] #讀取Jan至may列及 eggs 與 spam二欄的資料

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

In [19]:
df.iloc[[0, 4, 5], 0:2] #讀取 0, 4, 5列及 0到2欄的資料 （不包含第2欄)

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

In [20]:
df['eggs'] #讀 eggs 單一欄的資料，結果是一個序列（series）

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [21]:
type(df['eggs'])

pandas.core.series.Series

In [22]:
df[['eggs']] #讀取單一欄 eggs 的資料，結果為一資料匡

       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205

In [23]:
type(df[['eggs']])

pandas.core.frame.DataFrame

利用判斷式讀取資料

In [24]:
df.salt >60 #產生布林值結果

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [25]:
df[df.salt > 60] #選取布林值為True的資料

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [26]:
enough_salt_sold = df.salt > 60
df[enough_salt_sold]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [27]:
df[(df.salt>=50) & (df.eggs<200)]

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [28]:
df2 = df.copy()
df2['Bacon']=[0,0,50,60,70,80]

In [29]:
df2

       eggs  salt  spam  Bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0     5     80

In [31]:
df2.loc[:, df2.all()] #選取所有不為0的欄

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0     5

In [32]:
df2.all()

eggs      True
salt      True
spam      True
Bacon    False
dtype: bool

In [33]:
df2.any()

eggs     True
salt     True
spam     True
Bacon    True
dtype: bool

In [34]:
df2.loc[:, df2.any()] #選取任何不為0的欄

       eggs  salt  spam  Bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0     5     80

In [37]:
df2.loc[:, df2.isnull().any()] #選取任何有NaN的欄

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

In [58]:
df.loc[:, df.notnull().all()] #選取所有沒有NaN的欄

       eggs  spam  dozens_of_eggs
month
jan      47    17               3
feb     110    31               9
mar     226    72              18
apr      82    20               6
may     132    52              11
jun     210     5              17

In [39]:
df2

       eggs  salt  spam  Bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0     5     80

In [40]:
df2.dropna(how='any') #刪除任何有NaN的資料列

       eggs  salt  spam  Bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
Jun     205  60.0     5     80

In [41]:
df.eggs[df.salt>55] #根據salt欄位值得判斷式選取eggs欄位的值

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

In [42]:
df.eggs[df.salt>55] += 5 #根據其他欄位修改某欄內容

/var/folders/jn/ytjf98k55011kgx0mf58rr3w0000gn/T/ipykernel_1021/1676349003.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.eggs[df.salt>55] += 5

In [43]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     226  89.0    72
Apr      82  87.0    20
May     132   NaN    52
Jun     210  60.0     5

執行欄向量函數轉換

In [44]:
df.floordiv(12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     0

In [45]:
import numpy as np
np.floor_divide(df, 12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     0

In [46]:
def dozens(n):
    return n//12

In [47]:
df.apply(dozens)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     0

In [48]:
df.apply(lambda n: n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      18   7.0     6
Apr       6   7.0     1
May      11   NaN     4
Jun      17   5.0     0

將欄位轉換後儲存新的欄位

In [49]:
df['dozens_of_eggs']=df.eggs.floordiv(12)

In [50]:
df

       eggs  salt  spam  dozens_of_eggs
month
Jan      47  12.0    17               3
Feb     110  50.0    31               9
Mar     226  89.0    72              18
Apr      82  87.0    20               6
May     132   NaN    52              11
Jun     210  60.0     5              17

In [51]:
df.index

Index(['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'], dtype='object', name='month')

使用字串函數

In [52]:
df.index = df.index.str.upper()

In [53]:
df

       eggs  salt  spam  dozens_of_eggs
month
JAN      47  12.0    17               3
FEB     110  50.0    31               9
MAR     226  89.0    72              18
APR      82  87.0    20               6
MAY     132   NaN    52              11
JUN     210  60.0     5              17

處理字串

In [54]:
df.index = df.index.map(str.lower)

In [55]:
df

       eggs  salt  spam  dozens_of_eggs
month
jan      47  12.0    17               3
feb     110  50.0    31               9
mar     226  89.0    72              18
apr      82  87.0    20               6
may     132   NaN    52              11
jun     210  60.0     5              17

利用其他欄位建立新欄位

In [56]:
df['salty_eggs']=df.salt+df.dozens_of_eggs

In [57]:
df

       eggs  salt  spam  dozens_of_eggs  salty_eggs
month
jan      47  12.0    17               3        15.0
feb     110  50.0    31               9        59.0
mar     226  89.0    72              18       107.0
apr      82  87.0    20               6        93.0
may     132   NaN    52              11         NaN
jun     210  60.0     5              17        77.0